In [51]:
import pandas as pd
import numpy as np

Pandas series

In [52]:
labelsList = ['a','b','c']
num_list = [20,40,45]
numarray = np.array([20,40,45])
dic = {'a':20, 'b':40, 'c':45}

In [53]:
pd.Series(num_list, index=labelsList)

a    20
b    40
c    45
dtype: int64

In [54]:
pd.Series(dic)

a    20
b    40
c    45
dtype: int64

In [55]:
pd.Series(data=labelsList)

0    a
1    b
2    c
dtype: object

In [56]:
pd.Series([sum,print, len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [57]:
countries = pd.Series([2,4,6,8], index=['CAMEROON','NIGERIA','ETHIOPIA','UGANDA'])
countries

CAMEROON    2
NIGERIA     4
ETHIOPIA    6
UGANDA      8
dtype: int64

In [58]:
countries['CAMEROON']

2

_Working with Pandas DataFarmes_

In [59]:
from numpy.random import randn

In [60]:
np.random.seed(201)

In [61]:
#creating a dataframe
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W', 'X', 'Y', 'Z'])
df

          W         X         Y         Z
A  0.316783 -0.493417  1.217946  0.436771
B -0.727693  0.430307 -0.686665 -0.453018
C -0.732859 -0.753627 -0.832519  0.449872
D  1.807523 -0.489531  0.881589 -0.698341
E -0.049975  1.907522 -0.327623  1.150032

In [62]:
df['W']

A    0.316783
B   -0.727693
C   -0.732859
D    1.807523
E   -0.049975
Name: W, dtype: float64

In [63]:
type(df['W'])

pandas.core.series.Series

In [64]:
type(df)

pandas.core.frame.DataFrame

In [65]:
df[['W','Z']]

          W         Z
A  0.316783  0.436771
B -0.727693 -0.453018
C -0.732859  0.449872
D  1.807523 -0.698341
E -0.049975  1.150032

In [66]:
#adding culumns
df['Z1'] = df['W'] + df['Y']

In [67]:
df

          W         X         Y         Z        Z1
A  0.316783 -0.493417  1.217946  0.436771  1.534729
B -0.727693  0.430307 -0.686665 -0.453018 -1.414358
C -0.732859 -0.753627 -0.832519  0.449872 -1.565378
D  1.807523 -0.489531  0.881589 -0.698341  2.689112
E -0.049975  1.907522 -0.327623  1.150032 -0.377597

In [68]:
#removing columns
df.drop('Z1', axis=1, inplace=True)

In [69]:
df.drop('E', axis=0)

          W         X         Y         Z
A  0.316783 -0.493417  1.217946  0.436771
B -0.727693  0.430307 -0.686665 -0.453018
C -0.732859 -0.753627 -0.832519  0.449872
D  1.807523 -0.489531  0.881589 -0.698341

In [70]:
#selecting rows and columns from a dataframe
df.loc['A']

W    0.316783
X   -0.493417
Y    1.217946
Z    0.436771
Name: A, dtype: float64

In [71]:
df.loc['A', 'X']

-0.4934170968496873

In [72]:
df.loc[['A','C'],['X','Y']]

          X         Y
A -0.493417  1.217946
C -0.753627 -0.832519

_using conditional selections_

In [73]:
df > 0

       W      X      Y      Z
A   True  False   True   True
B  False   True  False  False
C  False  False  False   True
D   True  False   True  False
E  False   True  False   True

In [74]:
booleandf = df > 0

In [75]:
booleandf

       W      X      Y      Z
A   True  False   True   True
B  False   True  False  False
C  False  False  False   True
D   True  False   True  False
E  False   True  False   True

In [76]:
df[booleandf]

          W         X         Y         Z
A  0.316783       NaN  1.217946  0.436771
B       NaN  0.430307       NaN       NaN
C       NaN       NaN       NaN  0.449872
D  1.807523       NaN  0.881589       NaN
E       NaN  1.907522       NaN  1.150032

In [77]:
df

          W         X         Y         Z
A  0.316783 -0.493417  1.217946  0.436771
B -0.727693  0.430307 -0.686665 -0.453018
C -0.732859 -0.753627 -0.832519  0.449872
D  1.807523 -0.489531  0.881589 -0.698341
E -0.049975  1.907522 -0.327623  1.150032

In [78]:
df['W']>0

A     True
B    False
C    False
D     True
E    False
Name: W, dtype: bool

In [79]:
df[df['W']>0]

          W         X         Y         Z
A  0.316783 -0.493417  1.217946  0.436771
D  1.807523 -0.489531  0.881589 -0.698341

_Dealing with Missing Date_

In [80]:
y = {'A':[2,5,np.nan], 'B':[7,np.nan,np.nan],'C':[7,3,9]}

In [81]:
df = pd.DataFrame(y)

In [82]:
df

     A    B  C
0  2.0  7.0  7
1  5.0  NaN  3
2  NaN  NaN  9

In [83]:
df.dropna(axis = 1)

   C
0  7
1  3
2  9

In [84]:
df

     A    B  C
0  2.0  7.0  7
1  5.0  NaN  3
2  NaN  NaN  9

In [85]:
df.dropna(thresh=2)

     A    B  C
0  2.0  7.0  7
1  5.0  NaN  3

In [86]:
df.fillna(value='fill')

      A     B  C
0     2     7  7
1     5  fill  3
2  fill  fill  9

In [87]:
df.fillna(value=df.mean())

     A    B  C
0  2.0  7.0  7
1  5.0  7.0  3
2  3.5  7.0  9

reading data from other sources

###### reading from html

In [88]:
df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [89]:
type(df)

list

In [96]:
df[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020"
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020"
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"

###### reading from csv

In [99]:
banks = pd.read_csv('banklist.csv')

In [100]:
banks.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 551 entries, 0 to 550
Data columns (total 7 columns):
Bank Name                551 non-null object
City                     551 non-null object
ST                       551 non-null object
CERT                     551 non-null int64
Acquiring Institution    551 non-null object
Closing Date             551 non-null object
Updated Date             551 non-null object
dtypes: int64(1), object(6)
memory usage: 30.2+ KB

In [101]:
banks.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb",26-May-17,1-Jun-17
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,5-May-17,1-Jun-17
2,First NBC Bank,New Orleans,LA,58302,Whitney Bank,28-Apr-17,23-May-17
3,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,3-Mar-17,18-May-17
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17

In [102]:
#column names
banks.columns

Index(['Bank Name', 'City', 'ST', 'CERT', 'Acquiring Institution',
       'Closing Date', 'Updated Date'],
      dtype='object')

In [103]:
#number of states represented
banks['ST'].nunique()

44

In [104]:
banks['ST'].unique()

array(['IL', 'WI', 'LA', 'UT', 'NJ', 'AR', 'GA', 'PA', 'TN', 'WA', 'CO',
       'PR', 'FL', 'MN', 'CA', 'MD', 'OK', 'OH', 'SC', 'VA', 'ID', 'TX',
       'CT', 'AZ', 'NV', 'NC', 'KY', 'MO', 'KS', 'AL', 'MI', 'IN', 'IA',
       'NE', 'MS', 'NM', 'OR', 'NY', 'MA', 'SD', 'WY', 'WV', 'NH', 'HI'],
      dtype=object)

In [107]:
#top N states with failed banks
banks.groupby('ST').count().sort_values('Bank Name', ascending=False).iloc[:5]['Bank Name']

ST
GA    93
FL    75
IL    67
CA    41
MN    23
Name: Bank Name, dtype: int64

In [108]:
#top N acquiring banks
banks['Acquiring Institution'].value_counts().iloc[:5]

No Acquirer                            31
State Bank and Trust Company           12
First-Citizens Bank & Trust Company    11
Ameris Bank                            10
U.S. Bank N.A.                          9
Name: Acquiring Institution, dtype: int64

In [111]:
# whats the most common city in California for a bank to fail in
banks[banks['ST']=='CA'].groupby ('City').count().sort_values('Bank Name', ascending=False).head(4)

,Bank Name,ST,CERT,Acquiring Institution,Closing Date,Updated Date
City,,,,,,
Los Angeles,4,4,4,4,4,4
San Diego,2,2,2,2,2,2
San Francisco,2,2,2,2,2,2
Palm Desert,2,2,2,2,2,2

In [114]:
#number of banks without the word bank in their name
sum(banks['Bank Name'].apply(lambda name: 'Bank' not in name))

14

In [115]:
#bank names starting with the letter S
sum(banks['Bank Name'].apply(lambda name: name[0].upper() =='S'))

53

In [117]:
#banks consisting of two words
sum(banks['Bank Name'].apply(lambda name: len(name.split())==2))

114

In [118]:
#how many banks failed in 2008?
banks.head(2)

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb",26-May-17,1-Jun-17
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,5-May-17,1-Jun-17

In [123]:
sum(banks['Closing Date'].apply(lambda date: date[-2:] == '09'))

140